import streamlit as st 
# import plotly.express as px

def run_tab(): 
    # ----------------------------------------------------------------------- layout 
    t0_head0, t0_head1, t0_head2 = st.columns( [0.2, 0.6, 0.2] )
    t0_headt0,t0_headt1,t0_headt2= st.columns( [0.01, 0.98, 0.01] )

    t0_body0, t0_body1, t0_body2 = st.columns( [0.2, 0.6, 0.2] )
    t0_bodyt0,t0_bodyt1,t0_bodyt2= st.columns( [0.01, 0.98, 0.01] )

    t0_tail0, t0_tail1, t0_tail2 = st.columns( [0.2, 0.6, 0.2] ) 

    # -----------------------------------------------------------------------  
    t0_head0.markdown("###### 이달의 이슈 (순위별 현황)") 
    t0_head0.markdown("오늘의 이슈") 
    t0_head0.markdown("오늘의 이슈") 
    t0_head0.markdown("오늘의 이슈") 
    t0_head0.markdown("오늘의 이슈") 
    t0_head0.markdown("오늘의 이슈") 
    t0_head0.markdown("오늘의 이슈") 
    t0_head0.markdown("오늘의 이슈") 
    t0_head0.markdown("오늘의 이슈") 
    # -----------------------------------------------------------------------  
    t0_head1.markdown("###### 민원건수 현황") 

    # -----------------------------------------------------------------------  
    t0_head2.markdown("###### 지사.노선별 현황") 
    
    # -----------------------------------------------------------------------  
    t0_headt1.markdown("""---""")     
    # -----------------------------------------------------------------------  
    t0_body0.markdown("###### 민원 키워드 클라우드") 

    # -----------------------------------------------------------------------  
    t0_body1.markdown("###### 공지사항") 