import streamlit as st 
# import plotly.express as px

def run_tab(): 
    # ----------------------------------------------------------------------- layout 
    head0, head1, head2, head3, head4 = st.columns( [0.2, 0.2, 0.2, 0.2, 0.2] )
    
    body0, body1, body2, body3, body4 = st.columns( [0.2, 0.2, 0.2, 0.2, 0.2] )

    tail0, tail1, tail2, tail3, tail4 = st.columns( [0.2, 0.2, 0.2, 0.2, 0.2] )

    # -----------------------------------------------------------------------  
    head0.markdown("###### 주요 민원별 현황") 
    head0.markdown("주요 민원별 현황") 
    head0.markdown("주요 민원별 현황") 
    # -----------------------------------------------------------------------  
    head1.markdown("###### 날짜") 

    # -----------------------------------------------------------------------  
    head2.markdown("###### 날짜") 
    
    # -----------------------------------------------------------------------  
    body0.markdown("###### 포트홀 민원") 
    body0.markdown("포트홀 민원") 
    body0.markdown("포트홀 민원") 
    body0.markdown("포트홀 민원") 
    body0.markdown("포트홀 민원") 
    body0.markdown("포트홀 민원") 
    body0.markdown("포트홀 민원") 
    body0.markdown("포트홀 민원") 

    # -----------------------------------------------------------------------  
    body1.markdown("###### 휴게소 민원") 

    # -----------------------------------------------------------------------  
    body2.markdown("###### 서비스 민원") 

    # -----------------------------------------------------------------------  
    body3.markdown("###### 서비스2 민원") 

    # -----------------------------------------------------------------------  
    body4.markdown("###### 기타 민원") 